{
  "name": "Gravity",
  "steps": [
    "Shift the balance to the right foot, pivot ninety (90) degrees to the left, assume a front stance, down block.",
    "Step forward, assume a front stance, middle block (Inside).",
    "Shift the balance to the left foot, pivot one-hundred eighty (180) degrees to the right, assume a front stance, down block.",
    "Step forward, assume a front stance, middle block (Inside).",
    "Shift the balance to the right foot, pivot ninety (90) degrees to the left, assume a front stance, down block.",
    "Reverse punch.",
    "Step forward, assume a front stance, rising block.",
    "Step forward, assume a front stance, rising block.",
    "Step forward, assume a front stance, middle punch, KIHAP.",
    "Turn around 180 degrees to the left, front stance, middle punch.",
    "Execute a front kick, turn your attention 90 degrees to the left, assume a horse stance and double middle punch (right, left).",
    "Turn your attention ninety (90) degrees to the right, execute a front kick.",
    "Pivot ninety (90) degrees to the right, horse stance, double middle punch (left, right).",
    "Maintain your attention straight ahead, shift the balance to the left foot, step forward and assume a front stance, middle block (Outside).",
    "Execute a round kick, step forward, front stance, reverse punch.",
    "Step forward, front stance, reverse punch.",
    "Look over your right shoulder, then turn 180 degrees to the left, assume a front, middle block (Outside).",
    "Execute a round kick, step forward, front stance, reverse punch.",
    "Step forward, front stance, reverse punch.",
    "Shift the balance to the left foot, pivot two-hundred seventy (270) degrees to the right, assume a front stance, rising block.",
    "Execute a front kick (focused), step forward into fighting stance.",
    "Execute a front kick (full speed), step forward, assume a front stance, triple middle punch, KIHAP.",
    "Shift the balance to the left foot, pivot two-hundred seventy (270) degrees to the left, assume a front stance, down block.",
    "Execute a crescent kick (Outside), step forward, front stance, reverse punch.",
    "Shift the balance to the left foot, pivot one-hundred eighty (180) degrees to the right, front stance, down block.",
    "Execute a crescent kick (Outside), step forward, front stance, reverse punch.",
    "Shift the balance to the right foot, pivot two-hundred seventy (270) degrees to the right, assume a front stance and down block.",
    "Step forward, assume a front stance, inside middle block.",
    "Step forward, assume a front stance, rising block.",
    "Step forward, assume a front stance, middle punch, KIHAP."
  ]
}
