{
  "name": "Gravity",
  "color": "yellow",
  "steps": [
    "Shift the balance to the right foot, pivot 90 degrees to the left, front stance, down block.",
    "Step forward, front stance, middle block (Inside).",
    "Shift the balance to the left foot, pivot 180 degrees to the right, front stance, down block.",
    "Step forward, front stance, middle block (Inside).",
    "Shift the balance to the right foot, pivot 90 degrees to the left, front stance, down block.",
    "Reverse punch.",
    "Step forward, front stance, rising block.",
    "Step forward, front stance, rising block.",
    "Step forward, front stance, middle punch, KIHAP.",
    "Turn around 180 degrees to the left, front stance, middle punch.",
    "Execute a front kick, turn your attention 90 degrees to the left, horse stance and double middle punch (right, left).",
    "Turn your attention 90 degrees to the right, execute a front kick.",
    "Pivot 90 degrees to the right, horse stance, double middle punch (left, right).",
    "Maintain your attention straight ahead, shift the balance to the left foot, step forward and front stance, middle block (Outside).",
    "Execute a round kick, step forward, front stance, reverse punch.",
    "Step forward, front stance, reverse punch.",
    "Look over your right shoulder, then turn 180 degrees to the left, front, middle block (Outside).",
    "Execute a round kick, step forward, front stance, reverse punch.",
    "Step forward, front stance, reverse punch.",
    "Shift the balance to the left foot, pivot 270 degrees to the right, front stance, rising block.",
    "Execute a front kick (focused), step forward into fighting stance.",
    "Execute a front kick (full speed), step forward, front stance, triple middle punch, KIHAP.",
    "Shift the balance to the left foot, pivot 270 degrees to the left, front stance, down block.",
    "Outside crescent kick, step forward, front stance, reverse punch.",
    "Shift the balance to the left foot, pivot 180 degrees to the right, front stance, down block.",
    "Outside crescent kick, step forward, front stance, reverse punch.",
    "Shift the balance to the right foot, pivot 270 degrees to the right, front stance and down block.",
    "Step forward, front stance, inside middle block.",
    "Step forward, front stance, rising block.",
    "Step forward, front stance, middle punch, KIHAP."
  ]
}
