{
  "name": "Walk in the park",
  "color": "red",
  "steps": [
    "Shift the balance to the right foot and pivot 90 to the left to a cat stance, reverse palm block (O-I)",
    "Uppercut.",
    "Double side kick (low, high), step forward to a fighting stance.",
    "Jump rear leg front kick, step forward while rotating 180 to the right to a front stance, palm pressing block.",
    "Jump side kick, step forward to a fighting stance.",
    "Spin hook kick, but spin only 270 to the right stepping backwards to a front stance tension horizontal spear hand.",
    "Snapping crescent kick (O-I) stepping forward to a fighting stance.",
    "Slide twist kick stepping forward to a fighting stance.",
    "Shift the balance to the right foot and pivot 135 to the right and assume a horse stance, left back fist to the rear with a right down block to the right. Attention should be towards the back fist.",
    "Right turning punch, Left turning punch.",
    "Right tension grabbing block to the right.",
    "Grab right wrist with left hand and pull back to a left chamber. Simultaneously execute a sliding side kick and kihap. Step forward to a fighting stance.",
    "Shift the balance to the right foot. Pivoting 225 to the left, bring the left foot to the right foot and execute a right (O-I) target down block (palm out).",
    "Jump in the air and turn 180 to the left. Land in a horse stance, right tension middle punch.",
    "Left tension middle punch.",
    "Shift your attention 90 to the left and pull the right foot to the left foot executing a right target punch.",
    "Step forward to an even stance and execute a stick block.",
    "Pull the left foot back to shoulder width, then pivot on the left foot 90 to the left stepping backwards with the right foot to a walking stance, reverse punch.",
    "Kneel down on right knee and punch.",
    "Reverse punch.",
    "Roll over right shoulder, standing up in an X-stance with the right foot in front of the left and execute a tension rising palm rising block.",
    "Grab attacker’s wrist with your left hand and execute a left leg snapping crescent kick. Shift your attention 90 to the left and step forward to a fighting stance.",
    "Roll over right shoulder and stand up with your right foot forward. Shifting your balance to the right foot, step forward while rotating 180 to the right and assume a back stance knife hand low X – block.",
    "Shift the balance to the right foot. Pull the left foot up and pivot 135 to the right, stepping backwards to a back stance, double knife hand guarding block.",
    "Maintaining your attention in the original direction, shift the balance to the right foot and pivot 45 to the left. Step forward to a front stance, reverse middle block (I-O).",
    "Reverse knife hand down block.",
    "Continue your attention in the original direction and step forward to a front stance, reverse back fist.",
    "Turn side kick (towards the right with the left foot).",
    "Shift your attention 90 to the right and execute a left ball of the foot round kick. Pivot your body back 90 to the left and step backwards to a back stance, knife hand square block.",
    "Three step jump 45 round – side kick, kihap. Land while turning 180 to the left to a back stance, double knife hand guarding block.",
    "Slide round kick and step forward to a front stance, tension grabbing block.",
    "Pull attacker’s arm behind you while rotating 360 to the right. Step forward to a front stance, knife hand strike.",
    "Reverse punch.",
    "Turn your attention 45 to the left. Double front kick, then step backwards to a front stance and execute a reinforced middle block.",
    "Double jumping crescent kick, land in a fighting stance.",
    "Slide side kick, then turn your attention 180 to the left and step backwards to a fighting stance.",
    "Roll forward over your right shoulder to a kneeling position (left knee down) and execute a reverse punch.",
    "Stand up while executing a rear leg front kick. Turn your attention 45 to the right and step forward while rotating 180 to the right to a cat stance, reverse double knife hand guarding block.",
    "Step forward to a cat stance, double knife hand guarding block.",
    "Step forward to a cat stance, guarding block.",
    "Jump rear leg side kick. Land in a fighting stance and immediately shift the balance to the left foot and pivot 180 to the left to a walking stance, reverse target punch.",
    "Step forward to a front stance, reverse rising elbow strike (targeted).",
    "Downwards knife hand strike, kihap.",
    "Shift the balance to the right foot, and pivot 90 to the left to a back stance, high X- block.",
    "Shift the balance to the right foot and shorten your stance to walking. Simultaneously grab the attacker’s arm and pull back into a reverse punch.",
    "Immediately step forward to a front stance, single knife hand guarding block.",
    "Shift the balance to the right foot and pivot 45 to the right to closed ready stance (B).",
    "Shift your attention 180 to the right, and execute a right jump spin crescent kick pivoting all the way around 270 and landing in a fighting stance.",
    "Turn hook kick stepping forward to a cat stance, low knife hand X- block.",
    "Twin horizontal elbow strikes to the rear.",
    "Horizontal spearhand to the throat.",
    "Protected vertical hammerfist to the groin.",
    "Twin middle blocks.",
    "Target vertical hammerfist, kihap.",
    "Step forward while rotating 180 to the right to a back stance, left backfist to the bridge of the nose and right down block simultaneously.",
    "Hopping forward with the left foot to an X- stance, protected back fist to the bridge of the nose.",
    "Turning round kick (with the right foot) and step forward to a back stance, double knife hand guarding block.",
    "Jump snapping crescent kick (O-I), land in a fighting stance.",
    "Turn side kick, step forward in a back stance, double knife hand guarding block.",
    "Shift the balance to the right foot and pivot 90 to the right and step backwards to a back stance, palm heel strike to the face and knife hand reverse rising block.",
    "Lunging forward with the left foot, execute a jump spin back fist landing in a cat stance.",
    "Pull the left foot up behind the right and pivot 135 to the left to a crane stance, guarding block.",
    "Step backwards to a horse stance, side punch.",
    "Shift your attention 90 to the left and execute a twin punch.",
    "Shift your attention 90 to the left and execute a side punch.",
    "Pull the left leg back to a knee block. Execute a descending palm block and reverse palm block (O-I) simultaneously.",
    "Step down into a horse stance, down block.",
    "Tension twin grabbing block.",
    "Right knee strike, kihap. Step back into a horse stance and execute a knife hand down block.",
    "Shift your attention 180 to the right shifting into an even stance and execute a stick block.",
    "Double side kick, step forward to a fighting stance.",
    "Jump rear leg front kick, then pivot 45 to the left to a front stance, reverse scissor block.",
    "Step forward to a front stance, reverse high knife hand middle block.",
    "Tension palm pushing block.",
    "Reverse punch, Kihap.",
    "Ax kick (O-I), step forward while rotating 180 to the left. Step backwards to a back stance, back fist to the temple.",
    "Turn around, back stance knife hand square block.",
    "Turn around, back stance reverse low double knife hand guarding block.",
    "Turn around, back stance double knife hand guarding block."
  ]
}
